[
    {
      "id": 4173,
      "date": "2023-12-15T05:06:11",
      "date_gmt": "2023-12-15T05:06:11",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=4173"
      },
      "modified": "2023-12-15T05:08:57",
      "modified_gmt": "2023-12-15T05:08:57",
      "slug": "top-5-sports-americans-bet-on",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/guide/alex-muiruri/top-5-sports-americans-bet-on/",
      "title": {
        "rendered": "Top 5 Sports Americans Bet On"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EThe sports betting industry has grown significantly thanks to the sports wagering legalisation activities in the US. The industry generated \u003Ca href=\"https://www.businessofapps.com/data/sports-betting-app-market/\"\u003E$7.4 billion in 2022\u003C/a\u003E, accounting for over 20% of global revenues. The trend is expected to continue, and we expect to see a market volume of $15.75 billion by 2028.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIn 2023, the most significant bets happen online as \u003Ca href=\"https://sportsbook.draftkings.com/\"\u003Emodern sports betting sites\u003C/a\u003E have become more secure, supporting anonymous wagering. Online bookies are so popular that you can bet on virtually any sport. But what sports should you bet on?&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ERead on to find out which sports most Americans bet on. We hope you can use the info to narrow down your search.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003E1. American Football\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image\"\u003E\u003Cimg decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/4zP9Z47XZgHn9LR6z3yx0Ttqmo_oORh0zud8Qdu0TwHgLyWK7QBgMvg_oWIQDyMZ56q3n4QkDYcua3XbupC3ChiTFzt3D2VkTvEOVhtzpWNPPgPyKN61yx0D03mIuasGP01Ezoq-Qfr_r4lkT5Lohfo\" alt=\"\"/\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EPhoto by \u003Ca href=\"https://www.pexels.com/photo/football-players-718952/\"\u003EJoe Calomeni\u003C/a\u003E&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ENFL football is perhaps the most popular sport in the US. Being the highest-rated and most-ranked sport in the US, it makes sense that many fans stream to online betting sites every Sunday. The NFL has 32 teams, including renowned names like the San Francisco 49ers and Dallas Cowboys, and the games are always competitive.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ESports fans also like to bet on college football games. The games are packed with a lot of excitement, producing great rivalries around the country and intense matches every Saturday. Most casino sites offer many betting options, including props,&nbsp; game lines, futures, and more, giving you plenty of ways to get involved.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003E2. Soccer\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cp\u003ESoccer has approximately \u003Ca href=\"https://www.britannica.com/sports/football-soccer\"\u003E250 million players\u003C/a\u003E across 200 countries, and has the largest fan base of 3.5 billion people. It’s treasured among bettors since it’s easy to understand and has plenty of matches to bet on. Popular soccer leagues to watch out for include the Premier League, Bundesliga, and UEFA Champions League.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ESoccer rules are simple, but the types of soccer bets are limitless. The most common is betting on either team to win a match. You can also place draw, halftime, money line, point spread, double chance, and correct score bets. You can’t get bored watching a game with so many betting options.&nbsp;&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003E3. Ice Hockey\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image\"\u003E\u003Cimg decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/YCwJ2iChOXS4G5zXn35vSQDw6cwlB1HVCdHGGiZ0e_qeEScOESC4TEIEEMfGEq30QaIee9kQggFTAHTxE7zD-2PSfz6Ey7HGDYFP3CKT7Ky4m7xOAqSCQSF92yziSd0ZB-r73HB_XOTRkM_xVI46dkM\" alt=\"\"/\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EPhoto by \u003Ca href=\"https://www.pexels.com/photo/playing-sport-game-competition-33286/\"\u003EPixabay\u003C/a\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EIce hockey is a popular sport in the US where players wear skates and compete on an ice rink. The National Hockey League pits together 25 of the most competitive clubs in the US and 7 in Canada to produce the most exciting matches. The NHL games are highly publicised with many betting options to choose from.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIce hockey has many betting options. Most players wager on the money line, where you pick the winner of the game. It’s the simplest form of betting and best for novice bettors. You can also wager on the puck line, where you think a team will win by a certain number of goals.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003E4. Basketball\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cp\u003EBasketball is played between two teams of five players who score goals by shooting the ball through a defender’s netted hoop. The game started in the US and grew to become one of the most popular games in the world. In sports betting, the NBA is the most popular professional league.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe league has many high-profile players, exciting games, and betting options. You can wager on the game&#8217;s point spread, money line, or total score. Sportsbooks also offer in-game and live wagering options, where sportsbooks offer ever-changing lines as the games unfold.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003E5. Baseball\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image\"\u003E\u003Cimg decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/Eo_0RlVk4j0I8ex8FRRFTA7OEmch5uMcgA1G6fe42pP6aPihq26bFCQz9Wkol0yRVbxRKt46DvfBQm4WLKDtYwM7qZcXwDksFuwrPV8Ntswpss10m3KpL2RvactO87tDQ0E9k3lh6QFDSFdmlVBMiaQ\" alt=\"\"/\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EPhoto by \u003Ca href=\"https://www.pexels.com/photo/selective-focus-of-baseball-pitcher-in-20-jersey-about-to-throw-ball-163487/\"\u003EPixabay\u003C/a\u003E&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EBaseball is a bat-and-ball sport played between two teams of nine players each. The players bat and attempt to score runs while the defending teams attempt to stop them from scoring. There are many baseball leagues in the US, including Major League Baseball, the National League, the American League, and the International League.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EBaseball offers unique betting options for beginners and dedicated sports fans. The four main types of bets include moneyline, run line, proposition, and totals. Prevalent bookmakers might allow you to wager on live matches, where you can wager on a game that has already started.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EHow to Choose Sports to Bet On\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cp\u003EThere are lots of reasons to consider one sport over the next to bet on. However, you should always consider games that you’re familiar with. After understanding the game, find tools to help you analyse teams and learn who’s dominating the matches. Study lineups, injuries, transfers, and other factors that could impact a game.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EEach sport has different rules and variables. For instance, games like American Football and soccer can be affected by the weather. Therefore, it’s good to adjust your strategy for each game. Find out what works for some sports and what doesn’t.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EConclusion\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cp\u003ESports betting in America has been increasing in popularity as more states continue to allow customers to wager legally. The industry is booming raising billions of dollars per year.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EPlayers have more sports betting options aside from dog and horse racing games. Learn the top five sports that Americans bet on. Find out what betting options the games offer before choosing your favourite game.&nbsp;\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EThe sports betting industry has grown significantly thanks to the sports wagering legalisation activities in the US. The industry generated $7.4 billion in 2022, accounting for over 20% of global revenues. The trend is expected to continue, and we expect to see a market volume of $15.75 billion by 2028.&nbsp; In 2023, the most significant [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/12/pexels-jeshootscom-1201996-1024x682.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [6],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4173"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=4173"
          }
        ],
        "version-history": [
          {
            "count": 1,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4173/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 4174,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4173/revisions/4174"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-content/uploads/2023/12/pexels-jeshootscom-1201996.jpg"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=4173"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=4173"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=4173"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 4028,
      "date": "2023-08-05T17:48:33",
      "date_gmt": "2023-08-05T17:48:33",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=4028"
      },
      "modified": "2023-08-05T17:48:59",
      "modified_gmt": "2023-08-05T17:48:59",
      "slug": "php-was-dead-10-years-ago-right",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/php/alex-muiruri/php-was-dead-10-years-ago-right/",
      "title": {
        "rendered": "PHP Was Dead 10 Years Ago, Right?"
      },
      "content": {
        "rendered": "\n\u003Cp\u003ETen years ago, tech pundits predicted the demise of PHP in web development. They claimed that the rise of modern frameworks, like Ruby on Rails and Node.js, would render the programming language obsolete.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, contrary to their speculations, PHP has not only survived but thrived over the past decade. Considering that 79% of websites use PHP today, the programming language seems to be doing quite well for a dying language. That’s because most sites rely on WordPress, Joomla, Drupal, or Magento, which use PHP to function.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ETo be fair, that number is declining, but not at an exponential rate as developers would expect. Most websites you see had the same functionality 10 years ago and will most likely remain the same for 20 or 30 years to come. So, even though there’s been a slight decline in PHP usage as a server-side scripting language, it would be foolish to write it off this early.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EBackground on PHP\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390-1024x682.jpg\" alt=\"\" class=\"wp-image-4091\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EBefore we delve into why many developers lost their confidence in PHP,&nbsp; let’s look at the history of PHP and how it became so popular.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EA Brief Overview of PHP\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EPHP was conceived three decades ago when Rasmus Lerdorf created the first incarnation of PHP, initially called PHP tools. Its name changed briefly from Forms Interpreter, finally settling on Personal Home Page Construction Kit, but more on that later.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe programming language had a simple set of CGI binaries written in C, built to help Rasmus track visits on his online resume. As Rasmus expanded on the language’s functionality, he encouraged the public to collaborate and improve it.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ERasmus never intended to create a programming language. However, because of its simplicity, PHP took off immediately after it launched in the 90s. It allowed developers to create fully functional websites in a few hours or days. \u003C/p\u003E\n\n\n\n\u003Cfigure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"\u003E\u003Cdiv class=\"wp-block-embed__wrapper\"\u003E\n\u003Ciframe loading=\"lazy\" title=\"PHP isn&#039;t dead feat. the Laravel Origins cast\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/PXx9_FFZi8A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen\u003E\u003C/iframe\u003E\n\u003C/div\u003E\u003C/figure\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EThe Rise of PHP Programming Language\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EWhen PHP integrated Apache and MySQL in 95, it made building websites much easier. In 2005, developers integrated Zend Engine to offer features like object-oriented programming, PHP Data Objects (PDO), and other performance enhancement features.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThanks to Zend Engine, PHP became a more reliable and secure language. Later in 2008, PHP 5 was updated with features like namespaces, lambdas, and an improved object model. By this time, some developers had switched to other trending programming languages like Java and Ruby on Rails.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe introduction of new frameworks such as Symfony and Laravel was a significant change that most developers wanted. It enabled them to create fast and well-structured solutions for web applications. The rise of platforms like WordPress and Joomla also made it easier to create dynamic websites with little coding knowledge.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EReasons behind PHP&#8217;s popularity at that time.\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIt’s no surprise that PHP was so popular in the early days. It was an open-source language, meaning developers could tinker around with it and alter its code to meet their own needs.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ESecond, creating a website was straightforward and required minimal coding knowledge – in fact, most self-taught developers often start with PHP before advancing to other languages.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EPHP became popular in the web development realm for several key reasons:\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cstrong\u003EEase of Use\u003C/strong\u003E: PHP&#8217;s syntax was easy to understand. The language also offered a low learning curve compared to other languages, which also contributed to its widespread adoption.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EOpen Source Community &amp; Support\u003C/strong\u003E: The open-source community was an invaluable asset for PHP developers. It allowed developers to collaborate on projects and come up with innovative solutions. There were also many tutorials and support documentation available online.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003ECompatibility with Web Services &amp; Databases\u003C/strong\u003E: PHP was compatible with most web services and databases such as MySQL and PostgreSQL. This made it a great choice for developers wanting to create dynamic websites quickly without having to worry about compatibility issues.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EIntegration with HTML\u003C/strong\u003E: PHP could be embedded directly into HTML code, eliminating the need for separate CGI files. It was compatible with most servers and databases, offering a versatile solution for web development across different platforms.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003ECommunity Support\u003C/strong\u003E: PHP had a robust community of developers who continuously contributed to its development and improvement. The availability of numerous libraries and tools further facilitated its use.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EFrameworks\u003C/strong\u003E: The advent of PHP frameworks like Joomla, Laravel, and WordPress simplified the development process, making it easier to build robust web applications.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EPerformance\u003C/strong\u003E: PHP required little server requirements compared to other languages. With the introduction of the Zend Engine, PHP&#8217;s performance significantly improved, making it a reliable choice for web development projects.\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EPHP Decline in Popularity\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/08/programmer-g615bcff1e_1280-1024x576.jpg\" alt=\"\" class=\"wp-image-4093\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/08/programmer-g615bcff1e_1280-1024x576.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/08/programmer-g615bcff1e_1280-300x169.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/08/programmer-g615bcff1e_1280-768x432.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/08/programmer-g615bcff1e_1280.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EDespite its popularity, PHP&#8217;s decline was inevitable. The rise of alternative technologies led to a gradual decline in the popularity of PHP over the years. The language was criticized for its lack of scalability and security, making it unsuitable for complex web development projects.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe perception that PHP was outdated and not suitable for modern web development also contributed to its decreasing usage. As developers sought out newer technologies, PHP gradually lost its market share in the industry.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EThe Rise of Node.js\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIn the midst of the growing dissatisfaction with PHP, a new player&nbsp; – Node.js – entered the field. Launched in 2009, Node.js provided developers with the ability to write server-side applications in JavaScript.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt took advantage of the V8 JavaScript engine&#8217;s rapid execution speed, combined with its non-blocking I/O model, to create fast and scalable network applications.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ENode.js also came with a rich package ecosystem through npm, a package manager, offering developers a wide array of modules and packages to use in their applications. This led to a surge in its popularity and adoption in the tech community.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EThe Emergence of React\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EReact, developed and maintained by Facebook, was released in 2013 and quickly gained traction as a powerful JavaScript library for building user interfaces. React introduced the concept of a virtual DOM, drastically improving performance by minimizing direct manipulation of the HTML DOM.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis allowed developers to create large-scale applications that were both dynamic and fast. React also used a unidirectional data flow and component-based architecture, making code easier to understand and manage.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIts ability to create complex front-end applications, combined with its efficient performance, catapulted React to the forefront of JavaScript libraries.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EThe Advent of Angular\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EAngular, another significant player in the JavaScript ecosystem, was developed by Google and released in 2010. Angular introduced the concept of two-way data binding, reducing the amount of boilerplate code developers had to write.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt also promoted the use of TypeScript, a statically typed superset of JavaScript, which helped in catching errors during development and resulted in cleaner, more maintainable code.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EAngular&#8217;s comprehensive approach to web development, including built-in solutions for routing, state management, and form handling, made it a go-to option for developers building complex applications.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EThe Rise of Other Technologies\u003C/strong\u003E\u003C/h3\u003E\n\n\n\n\u003Cp\u003EThe rise of modern frameworks made it easier for developers to create sophisticated web applications without relying on server-side scripting languages such as PHP.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe introduction of open-source platforms such as WordPress and Joomla also led to a decrease in the need for customized development. As a result, the demand for PHP developers has been declining steadily over the years.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EPHP&#8217;s Revival\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/08/Web-Services-13-1024x768.jpeg\" alt=\"\" class=\"wp-image-4096\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/08/Web-Services-13-1024x768.jpeg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/08/Web-Services-13-300x225.jpeg 300w, https://alexmuiruri.com/wp-content/uploads/2023/08/Web-Services-13-768x576.jpeg 768w, https://alexmuiruri.com/wp-content/uploads/2023/08/Web-Services-13.jpeg 1058w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EFortunately, the PHP community did not give up on the language. They continued to improve and refine it to meet the demands of modern web development. In 2015, PHP 7 was released with upgraded features like reduced memory usage, improved security, and enhanced reliability.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis version included new language features such as scalar type declarations and return type declarations that enabled developers to write more performant code.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe introduction of modern PHP frameworks like Laravel and Symfony further revitalized the language. These frameworks provided developers with a set of tools and libraries for quickly building web applications without having to start from scratch.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Cstrong\u003ECurrent State of PHP\u003C/strong\u003E\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-full\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"651\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/08/Laravel-framework-shares.png\" alt=\"\" class=\"wp-image-4095\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/08/Laravel-framework-shares.png 1024w, https://alexmuiruri.com/wp-content/uploads/2023/08/Laravel-framework-shares-300x191.png 300w, https://alexmuiruri.com/wp-content/uploads/2023/08/Laravel-framework-shares-768x488.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EToday, PHP&#8217;s usage is higher than ever before. According to the latest statistics, over 80% of websites are built using server-side scripting languages like JavaScript, Python, and PHP.\u003C/p\u003E\n\n\n\n\u003Cp\u003EMoreover, the majority of that number is still made up of PHP; over 75% of websites are built using this language. This indicates its high level of popularity and usage despite the emergence of alternative technologies in recent years.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe continuing development and support for PHP by the community further suggest that it is here to stay for a long time. This is evident in the numerous libraries and packages available for PHP, as well as the newly released features with each version.\u003C/p\u003E\n\n\n\n\u003Ch1 class=\"wp-block-heading\"\u003E\u003Cstrong\u003EConclusion\u003C/strong\u003E\u003C/h1\u003E\n\n\n\n\u003Cp\u003EIt&#8217;s clear that PHP has come a long way since its decline in popularity over 10 years ago. The language was able to survive by adapting to the needs of modern web development, thanks to the efforts of the community and the introduction of new frameworks.\u003C/p\u003E\n\n\n\n\u003Cp\u003EToday, PHP is still a relevant language that&#8217;s used to build websites and applications across the web. It has seen a resurgence in its popularity due to increased performance, advanced features, and ease of development.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe past 10 years have been an interesting journey for PHP &#8211; from being on the brink of extinction to regaining its footing as one of the top programming languages for web development. With all the advancements being made, we can only look forward to what&#8217;s in store for the language in the future.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIn short, PHP isn&#8217;t dead yet &#8211; far from it! It is continuing to grow and evolve with each new version. As a result, developers can be confident that they&#8217;ll continue to have a powerful programming language to use in their projects.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESo, if you&#8217;re looking for a reliable language to build your next web application with, look no further than PHP! There&#8217;s certainly no better choice out there. It&#8217;s time to get coding! \u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003ETen years ago, tech pundits predicted the demise of PHP in web development. They claimed that the rise of modern frameworks, like Ruby on Rails and Node.js, would render the programming language obsolete.&nbsp; However, contrary to their speculations, PHP has not only survived but thrived over the past decade. Considering that 79% of websites use [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/08/pexels-realtoughcandycom-11035390-1024x682.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [28],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4028"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=4028"
          }
        ],
        "version-history": [
          {
            "count": 34,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4028/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 4101,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/4028/revisions/4101"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/4091"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=4028"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=4028"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=4028"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3974,
      "date": "2023-03-21T17:55:08",
      "date_gmt": "2023-03-21T17:55:08",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3974"
      },
      "modified": "2023-03-21T17:55:10",
      "modified_gmt": "2023-03-21T17:55:10",
      "slug": "the-importance-of-seo-in-digital-marketing",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/experience/alex-muiruri/the-importance-of-seo-in-digital-marketing/",
      "title": {
        "rendered": "The importance of SEO in Digital Marketing"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EDigital marketing is a powerful tool modern businesses use to connect with their target audience, increase visibility, and drive sales. It encompasses a wide range of strategies and tactics, each with its unique benefits and challenges.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESEO could be the most critical aspect of digital marketing. You’ve probably heard that it pulls traffic and improves your website’s ranking on SERPs, but do you know how SEO works and why it’s essential in digital marketing?\u003C/p\u003E\n\n\n\n\u003Cp\u003EHere&#8217;s everything you need to know about SEO and why it’s vital in today’s digital marketing.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003EWhat is SEO?\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-oleksandr-pidvalnyi-9822732-1024x682.jpg\" alt=\"\" class=\"wp-image-3975\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-oleksandr-pidvalnyi-9822732-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-oleksandr-pidvalnyi-9822732-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-oleksandr-pidvalnyi-9822732-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-oleksandr-pidvalnyi-9822732.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003ESearch Engine Optimization (SEO) is optimizing website HTML and content to improve your website’s ranking and visibility in \u003Ca href=\"https://mailchimp.com/marketing-glossary/serp/\"\u003ESERP\u003C/a\u003Es.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt comprises keyword research, on-page optimization, off-page optimization, technical optimization, localization, and content marketing.\u003C/p\u003E\n\n\n\n\u003Cp\u003EAll that simply means creating valuable content, changing the website and content structure, and building high-quality backlinks from other websites.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESEO is valuable for brand awareness and positioning yourself as an authoritative and trustworthy expert. While it demands time and consistent effort, the results are worth the wait and offer excellent long-term benefits.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003EImportance of SEO in Digital Marketing\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336-1024x768.jpg\" alt=\"\" class=\"wp-image-3976\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336-1024x768.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336-300x225.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336-768x576.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EHere are the key benefits of SEO in digital marketing:\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E1. Increased Visibility\u003C/h3\u003E\n\n\n\n\u003Cp\u003ESearch engine visibility is the percentage of traffic your website receives from organic searches. Visibility relies on the position of your website on SERPs.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESince users will interact with the top 10 websites on the first SERP, ranking higher can increase visibility and the potential to get clicks and visitors.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESEO helps you rank higher for relevant keywords. By producing ever-green content and optimizing keywords, you can ensure higher search engine rankings.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E2. Credibility and Trust\u003C/h3\u003E\n\n\n\n\u003Cp\u003EFrom a reader’s perspective, the higher your website ranks on search engines, the more likely it provides the relevant information they seek.\u003C/p\u003E\n\n\n\n\u003Cp\u003EUsers trust that search engines will choose the best results for their search queries. They will choose among the first 10 results because they view it as a credible source.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf you rank first on SERPs, users believe it’s the most relevant for their search. Your site will appear more credible and trustworthy to your readers.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E3. Gaining Targeted Traffic\u003C/h3\u003E\n\n\n\n\u003Cp\u003EAccording to Fundera, \u003Ca href=\"https://www.hubspot.com/marketing-statistics\"\u003E61% of marketers \u003C/a\u003Esay their biggest challenge is getting more target traffic and leads. However, you can’t get traffic without content and SEO.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESEO has the potential to generate up to \u003Ca href=\"https://www.digitalmarketing.org/blog/topdigitalmarketingtrends\"\u003E300% more traffic\u003C/a\u003E than the average social media campaign. You tap into an interested audience by optimizing keywords they usually search for.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESince most traffic from search engines is searching for products like yours, you get more qualified traffic than other marketing strategies.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E4. Cost-Effective Marketing\u003C/h3\u003E\n\n\n\n\u003Cp\u003E\u003Ca href=\"https://www.marketingprofs.com/charts/2012/7243/inbound-marketing-leads-cost-61-less-than-outbound\"\u003ESEO costs 61% less\u003C/a\u003E than outbound marketing strategies. It targets an audience that’s actively looking for specific products.\u003C/p\u003E\n\n\n\n\u003Cp\u003ETo increase conversion rates, you must answer all the basic questions. These include:\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003EWhat does your product offer?\u003C/li\u003E\n\n\n\n\u003Cli\u003EWhere it’s based?\u003C/li\u003E\n\n\n\n\u003Cli\u003EHow can a user buy the product from you?\u003C/li\u003E\n\n\n\n\u003Cli\u003EWhat’s the method of payment?\u003C/li\u003E\n\n\n\n\u003Cli\u003EAre there shipping fees applicable?\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cp\u003EWith the right background and research, you can reach these customers, and if your website is trustworthy, they’ll buy from you.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E5. Long-term growth\u003C/h3\u003E\n\n\n\n\u003Cp\u003ESEO is key to long-term business growth. It may take time and effort to rank on the first SERP, but you can attract many customers with one keyword phrase.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe higher your website ranks on SERPs for high volume and relevant keywords, the more quality traffic you attract.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou must constantly update your website content with high-quality, valuable content your readers are more likely to respond to.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe higher the response and the lower the bounce rate, the higher your website ranks on SERPs.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003EHow to Boost Your Search Engine Ranking\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"681\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-caio-67112-1024x681.jpg\" alt=\"\" class=\"wp-image-3977\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-caio-67112-1024x681.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-caio-67112-300x199.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-caio-67112-768x511.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-caio-67112.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EThere are many techniques to boost your search engine ranking and grow traffic. Most are long-term strategies that can attract organic traffic for centuries.\u003C/p\u003E\n\n\n\n\u003Cp\u003EHere are the top tips to improve your SEO:\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E1. Conduct keyword research\u003C/h3\u003E\n\n\n\n\u003Cp\u003EAlthough Google rolls out new \u003Ca href=\"https://searchengineland.com/library/platforms/google/google-algorithm-updates\"\u003Ealgorithm updates regularly\u003C/a\u003E, one thing remains in all rollouts: keyword research.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt involves analyzing search terms to acquire valuable data for smarter SEO decisions. You uncover queries to target, their ranking difficulty, and their popularity.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThrough keyword research, you’ll find queries that people type when searching for products.\u003C/p\u003E\n\n\n\n\u003Cp\u003ETo conduct keyword research, follow these steps:\u003C/p\u003E\n\n\n\n\u003Col type=\"1\" start=\"1\"\u003E\n\u003Cli\u003EMake a list of topics you’d like to write about based on what you know about your business.\u003C/li\u003E\n\n\n\n\u003Cli\u003EChoose one topic idea and brainstorm keywords you think customers type on search engines&#8217; search bars to find relevant information.\u003C/li\u003E\n\n\n\n\u003Cli\u003EUse \u003Ca href=\"https://analytics.google.com/analytics/web/\"\u003EGoogle Analytics\u003C/a\u003E to determine which keywords your website already ranks for\u003C/li\u003E\n\n\n\n\u003Cli\u003EType keywords on search engines to see what comes up and understand user intent\u003C/li\u003E\n\n\n\n\u003Cli\u003EFind related search terms at the bottom of search engine results to see some keyword suggestions\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://support.google.com/google-ads/answer/7337243?\"\u003EUse keyword tools\u003C/a\u003E to improve your keyword ideas\u003C/li\u003E\n\u003C/ol\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E2. Publish Relevant Content\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIn the SEO world, content is king. Quality and authoritative content are critical to higher search engine rankings; great content has no substitute.\u003C/p\u003E\n\n\n\n\u003Cp\u003EAs you write, target your keyword phrase and sprinkle secondary keywords sparingly inside the content. Don’t forget to use lists, sub-headings, and images to make your work more scannable.\u003C/p\u003E\n\n\n\n\u003Cp\u003EDo not sacrifice good writing for SEO. Creating curated content for users will increase engagement, traffic, authority, and relevance.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E3. Optimize your Website Structure\u003C/h3\u003E\n\n\n\n\u003Cp\u003EA well-defined site structure makes it easy for search engine crawlers to navigate and index your site.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou must organize your website into categories and use proper URLs so search engines can understand what you want to rank for.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe ideal structure of a small business or corporate website should have categories, pages, departments, and a blog section.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E4. Build high-quality backlinks\u003C/h3\u003E\n\n\n\n\u003Cp\u003EUsers are likelier to share content from a website with quality, authoritative, and unbiased content.  \u003C/p\u003E\n\n\n\n\u003Cp\u003EThe content will attract links from other sources, improving your search engine ranking, authority, and credibility.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can also share your content on social media and high-authority websites through guest posts.\u003C/p\u003E\n\n\n\n\u003Cp\u003EMany high-authority sites accept blog posts. Follow their guidelines to get published and featured on their websites.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003E5. Track Metrics with Google Analytics\u003C/h3\u003E\n\n\n\n\u003Cp\u003EGoogle Analytics provides insights into site visitors and how user experience affects conversions and retention.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt’s organized accordingly to help you understand your audience, acquisitions, behavior, and conversion rates.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can use these data insights to understand what keywords attract more readers and which channels perform better.\u003C/p\u003E\n\n\n\n\u003Cp\u003EUsing Google Analytics regularly helps you understand areas you need to improve. You can use it to find out what keywords you rank for.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003E\u003Ca\u003E\u003C/a\u003EWrapping Up\u003C/h2\u003E\n\n\n\n\u003Cp\u003EOver 20 years after its story began, SEO is still an essential digital marketing tool. You can use it to boost your sales, increase visibility, and gain targeted traffic.\u003C/p\u003E\n\n\n\n\u003Cp\u003EUse the above strategies to improve your search engine ranking. Don’t forget about Google Analytics. It’s an essential tool that can help you boost your sales and increase organic traffic.\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EDigital marketing is a powerful tool modern businesses use to connect with their target audience, increase visibility, and drive sales. It encompasses a wide range of strategies and tactics, each with its unique benefits and challenges. SEO could be the most critical aspect of digital marketing. You’ve probably heard that it pulls traffic and improves [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/03/pexels-kindel-media-7688336.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [4],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3974"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3974"
          }
        ],
        "version-history": [
          {
            "count": 1,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3974/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3978,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3974/revisions/3978"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3975"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3974"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3974"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3974"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3966,
      "date": "2023-03-04T08:56:21",
      "date_gmt": "2023-03-04T08:56:21",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3966"
      },
      "modified": "2023-03-04T22:02:32",
      "modified_gmt": "2023-03-04T22:02:32",
      "slug": "accelerate-your-business-growth-through-digital-transformation-key-insights-from-janes-tech-company",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/accelerate-your-business-growth-through-digital-transformation-key-insights-from-janes-tech-company/",
      "title": {
        "rendered": "Digital Transformation and Business Growth"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EDigital transformation is no longer optional for companies looking to accelerate their growth and remain competitive. In 2022, global digital transformation expenditure was projected to reach $1.6 trillion. That figure might surpass $3.4 trillion by 2026. This conveys a global cultural shift towards more agile and intelligent business methods. \u003C/p\u003E\n\n\n\n\u003Cp\u003ECompanies that fail to adopt digital transformation risk being left behind.\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, starting a digital transformation journey is not straightforward and requires a unique mindset. \u003Ca href=\"mckinsey.com/capabilities/people-and-organizational-performance/our-insights/unlocking-success-in-digital-transformations\"\u003EResearch shows\u003C/a\u003E that less than 26% of firms in digitally savvy industries and 7 -11% of those in traditional industries are successful in their digital transformation stories.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech is a leading technology services company that helps medium to large enterprises implement powerful technologies to execute their strategies.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis article explores how the company can help enterprises transform their digital capabilities to achieve business goals.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EThe Need for Digital Transformation&nbsp;\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"680\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280-1024x680.jpg\" alt=\"\" class=\"wp-image-3968\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280-1024x680.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280-300x199.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280-768x510.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech Company believes organizations need access to world-class technical talent to compete digitally, and the future belongs to those who leverage digital technology. It&#8217;s imprudent for companies to adopt new strategies to accelerate their growth.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EReasons to adopt digital transformation in the current business landscape include.&nbsp;&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003ELaunching Products Faster\u003C/h3\u003E\n\n\n\n\u003Cp\u003EDigital transformation reduces product lifecycles. With technology and automation, enterprises can quickly bring innovative products to the market. They can develop business models to enhance end-to-end integration and management of processes, data, technology, and people.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ECompanies must look at their product lifecycles to ensure digital continuity from ideation to product launch. This applies to all industries, including car assembly, food, chemicals, banking, and insurance. Doing so ensures that products are functionally rich and easy to use.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EEnhancing Customer Experience\u003C/h3\u003E\n\n\n\n\u003Cp\u003ECustomers drive most digital transformation efforts. They expect companies to post relevant content regarding current activities on popular channels. Enterprises must embrace technology to stay connected with customers and enhance their experience.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EMillennials and Zoomers are accustomed to cutting-edge apps on their smartphones. They expect enterprises to have simple yet feature-rich apps with good UX and UI.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThey want to \u003Ca href=\"https://www.businesswire.com/news/home/20131024006116/en/Millennials-Outspend-Baby-Boomer-Catching-Retail-Industry#.VADDeWNgNnV\"\u003Eperform most of their activities\u003C/a\u003E online; hence your company should strive to provide complete services via digital technologies.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EReducing Operation Costs\u003C/h3\u003E\n\n\n\n\u003Cp\u003ETechnology can increase company productivity and efficiency, reducing costs and maximizing revenues. Digitizing data-sensitive processes can cut costs by 90%, saving time and resources to spend on core company objectives.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EProductivity tools help improve operational efficiency, reduce paperwork and payroll, and cut costs. Cloud platforms lower up-front operation costs and reduce the burden of in-house talent management.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EMaking Better Decisions\u003C/h3\u003E\n\n\n\n\u003Cp\u003ECompanies can also use digital tech to collect information and get insights on their performance at all scales. Generating analytics based on strong logic and reliable information can help decision-makers weigh past and present data to make more confident decisions.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EFitting tech can improve productivity and reshape an organization. By using digital tech to understand factors that can improve business outcomes, leaders can focus on ideas that can deliver the desired impact.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIncreasing Agility and Adaptability\u003C/h3\u003E\n\n\n\n\u003Cp\u003EDigital tools help virtualize and manage processes and infrastructure, integrate remote and inter-person networks, and boost competitive advantage.\u003C/p\u003E\n\n\n\n\u003Cp\u003ECloud computing can enhance flexibility and product availability, while data analytics and AI can improve modeling and prediction, enhancing prototyping and testing speeds.\u003C/p\u003E\n\n\n\n\u003Cp\u003EOrganizations can utilize digital transformation to magnify their product and service innovation strategy. They must cultivate resilience and adaptability while remaining focused on the primary objective.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EPartnering with a Technology Services Company\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/03/digitization-g97763f249_1280-1024x682.jpg\" alt=\"\" class=\"wp-image-3967\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/03/digitization-g97763f249_1280-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/03/digitization-g97763f249_1280-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/03/digitization-g97763f249_1280-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/03/digitization-g97763f249_1280.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EAs 95% of companies plan to \u003Ca href=\"https://www.globenewswire.com/en/news-release/2022/05/02/2433639/11663/en/More-Work-More-Complexities-and-More-Investment-New-Data-from-GoTo-Analyzes-the-Challenges-of-Small-and-Midsize-Business-IT-Teams.html\"\u003Econsolidate their tech tools next year\u003C/a\u003E, one way to respond while focusing on company objectives is by seeking out technology partnerships.\u003C/p\u003E\n\n\n\n\u003Cp\u003EAfter all, companies with more robust tech and experience are more suited to solve customer problems.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EPartnerships can lead to more lead generation, faster development, increased employee retention, and improved customer engagement. With that in mind, Jane&#8217;s Tech Company invites organizations to partner to execute all their technology needs.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EIntroducing Jane&#8217;s Tech Company\u003C/h2\u003E\n\n\n\n\u003Cp\u003EIn 2022, Jane&#8217;s Tech Company partnered with Company B, a multi-billion dollar Danish e-commerce firm, to set up its first offshore development center in an emerging market. Company B was looking for a high-tech facility and needed tech talent.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIn under three months, Jane&#8217;s Tech set up a high-tech facility and launched a remote software development hub with eight software engineers &#8212; sourced by Jane&#8217;s Tech &#8212; and two managers from Company B.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe project was a huge success. The organization is now looking for global companies with similar needs to help them accelerate their growth.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EHere&#8217;s what Jane&#8217;s Tech Company can do for medium to large enterprises:&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EAccess World-class Tech Talent&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech is affiliated with world-class companies like C and D and serves as the bridge to connect those companies&#8217; talent to organizations worldwide. It helps businesses access a highly skilled and experienced team to help them achieve their goals.\u003C/p\u003E\n\n\n\n\u003Cp\u003EWhether an organization is looking for mid-senior tech talent or Silicon Valley fresh graduates, Jane&#8217;s Tech has the largest pool of tech talent globally.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIts unique talent competes with Ivy League graduates at companies like Tesla, NASA, Meta, Google, LinkedIn, and Apple. The company finds and connects the most fitting talent fitting for a brand, reducing talent acquisition costs and employee churn. (Assumption)\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EManage Global Talent\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech Company provides full HR solutions to help firms focus on core business operations, provide Fortune 500-level benefits, and offer extensive support.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt handles office infrastructure and admin tasks, including leases, taxes, contracting, and payroll, allowing you to focus on core business operations.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe Company has a digital platform where firms can collaborate with remote employees to unify data, improve productivity, and make informed decisions. Employees can manage their benefits, payroll, tax, and personal information from a centralized location.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EBusinesses can also send a manager to lead the team or embed the talent into their global team to join sprints or scrum meetings in their time zone. (Assumption)\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EBuild Your Brand\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech also builds helpful and innovative websites and social media pages to connect enterprises with customers. It has a dedicated team of engineers, supervisor(s), UX designers, and testers from their growing pool to help you launch projects fast.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe company can help enterprises to build unique brands from scratch, making them stand out from the competition. It offers curated services with the younger generations in mind to help clarify brands&#8217; positions, expand reach, and increase revenues.&nbsp;(Assumption)\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EImprove Business Strategies\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech helps businesses outline the plan of action to achieve an organization&#8217;s vision and set objectives. It guides the decision-making processes to improve the company’s financial stability in a competing market.\u003C/p\u003E\n\n\n\n\u003Cp\u003EBy partnering with Jane&#8217;s Tech, businesses can access a wide range of benefits that can help them achieve their goals, from hiring world-class technical talent to getting innovative solutions that can help them stay ahead of the competition.&nbsp;(Assumption)\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EAccess Global Innovation Ecosystem\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s Tech has acquired a platform to map the global innovation ecosystem and build the world&#8217;s largest directory of startups, investors, and innovators.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis platform allows it to embed cutting-edge technologies in fintech, agritech, healthcare, mobility, cybersecurity, last mile, AI, climate tech, renewable energy, and many other fields into solutions they build for businesses.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIn the specific case of Company B, based on their needs, the recommendation was for them to partner with Jane&#8217;s Tech to launch a dedicated offshore center in Eastern Europe, Latin America, or Africa to support the development and delivery of their key projects.&nbsp;(Assumption)\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EConclusion: Partner with Jane’s Tech Company\u003C/h2\u003E\n\n\n\n\u003Cp\u003EFor medium to large enterprises looking to transform digitally, partnering with Jane&#8217;s Tech Company means gaining access to top-tier tech talent, cutting-edge technologies, and innovative yet cost-effective solutions to support their business goals.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EJane&#8217;s offers:\u003C/p\u003E\n\n\n\n\u003Col type=\"1\"\u003E\n\u003Cli\u003E\u003Cem\u003EDigital transformation strategy\u003C/em\u003E. The company works with enterprises to develop a digital transformation strategy that aligns with their business goals and objectives.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cem\u003ETalent acquisition.\u003C/em\u003E The company sources and curates top talent for each project, drawing from its pool of mid-senior tech talent worldwide and their Silicon Valley software engineering school graduates.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cem\u003EOffshore team management\u003C/em\u003E. The company handles office infrastructure and admin duties like leases, taxes, office managers, contracting, and payroll.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cem\u003ECutting-edge technology solutions.\u003C/em\u003E The company has a platform that allows them to embed cutting-edge technologies in fintech, Agritech, healthcare, and many other fields into solutions they build for enterprises.\u003C/li\u003E\n\u003C/ol\u003E\n\n\n\n\u003Cp\u003EIn conclusion, partnering with Jane&#8217;s Tech is a sure way to ensure business agility, adaptability, and cost-effectiveness. Contact Jane&#8217;s Tech today to learn how we can help transform your business.\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003C/li\u003E\n\u003C/ul\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EDigital transformation is no longer optional for companies looking to accelerate their growth and remain competitive. In 2022, global digital transformation expenditure was projected to reach $1.6 trillion. That figure might surpass $3.4 trillion by 2026. This conveys a global cultural shift towards more agile and intelligent business methods.  Companies that fail to adopt digital [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/03/hands-g743253707_1280-1024x680.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3966"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3966"
          }
        ],
        "version-history": [
          {
            "count": 3,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3966/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3972,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3966/revisions/3972"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3967"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3966"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3966"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3966"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3889,
      "date": "2023-02-19T16:33:35",
      "date_gmt": "2023-02-19T16:33:35",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3889"
      },
      "modified": "2023-03-04T08:57:26",
      "modified_gmt": "2023-03-04T08:57:26",
      "slug": "create-your-own-router-class-in-php",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/experience/alex-muiruri/create-your-own-router-class-in-php/",
      "title": {
        "rendered": "How to Create a Custom Router Class in PHP"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EAre you looking for a way to hide your .PHP extension from the URL and secure your app. This article explores how you can create a custom router class to handle all your HTTP requests from the browser. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWorking with Routers\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/1_bvfc4WbLY5HV00VMCndazQ-1024x576.jpeg\" alt=\"\" class=\"wp-image-3894\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/1_bvfc4WbLY5HV00VMCndazQ-1024x576.jpeg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/1_bvfc4WbLY5HV00VMCndazQ-300x169.jpeg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/1_bvfc4WbLY5HV00VMCndazQ-768x432.jpeg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/1_bvfc4WbLY5HV00VMCndazQ.jpeg 1400w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EWhen using a PHP framework, you map file paths in the address bar directly to corresponding controllers. For example, when using Laravel, if you send a get request to the contact page, the controller will look for a file called \u003Cstrong\u003E\u003Ccode\u003Econtact.blade.php \u003C/code\u003E\u003C/strong\u003Eto return a valid response. \u003C/p\u003E\n\n\n\n\u003Cp\u003EYou register routes on your application in the \u003Ccode\u003Eroutes &gt; web.php\u003C/code\u003E file to be loaded when a certain request is made. A good example provided by Laravel is: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003ERouter::get('/', function(){\n     return view('welcome');\n}) \u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EThis returns the HTML template on \u003Ccode\u003Eresources \u003E views \u003E welcome.blade.php.\u003C/code\u003E So to create a another page like contact or about us, you create another router and a second template on the \u003Ccode\u003Eresources \u003E views\u003C/code\u003E folder. \u003C/p\u003E\n\n\n\n\u003Cp\u003EIt should look like this: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003ERouter::get('about-us', function(){\n     return view('about-us');\n}) \u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EIf you don&#8217;t create a router, it&#8217;ll return a 404 page or error in some frameworks. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhy Build a Custom PHP Router Class? \u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285-1024x682.jpg\" alt=\"\" class=\"wp-image-3913\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EThere are several reasons you might consider a custom router for your application: \u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EControl Over Requests\u003C/h3\u003E\n\n\n\n\u003Cp\u003ECustom controllers allow you to create a single entry point into your application where you access all requests sent from the browser. Whenever a user sends as a \u003Cmark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-cyan-bluish-gray-color\"\u003E\u003Ccode\u003E$_get, $_post, or $_file\u003C/code\u003E\u003C/mark\u003E request, you can call a certain class to handle the request.   \u003C/p\u003E\n\n\n\n\u003Cp\u003ESome developers also argue that you can secure your application better by using htaccess file. Since you&#8217;re using that to create a custom router, you might make your web application more secure. \u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EConcise and Shorter Code \u003C/h3\u003E\n\n\n\n\u003Cp\u003EMost frameworks come with a lot of stuff you barely need for your application. While some can help manage users and databases, you may only want a small website with a few pages and blog posts. \u003C/p\u003E\n\n\n\n\u003Cp\u003EUsing controllers is a good idea. However, you might want to reduce your code, especially if you&#8217;re building large projects, accessing different databases, or dealing with different kinds of data.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EBetter Organization\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIn PHP, organization is key to managing large projects. If you don&#8217;t organize your code, it&#8217;s easy to get messy, making it hard to make changes when needed. \u003C/p\u003E\n\n\n\n\u003Cp\u003EThe best way to organize your code is to shorten it with functions and classes. In the example I give below, you&#8217;ll find that most repeating lines of codes are placed in a loop or templates. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EBuild Core Files and Folders\u003C/h2\u003E\n\n\n\n\u003Cp\u003EIn your root folder, you&#8217;ll need four more folders: \u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cstrong\u003EAssets\u003C/strong\u003E: For your assets files, including images, CSS, JavaScript, and SCSS\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EDatabase\u003C/strong\u003E: For your database configuration files to connect, create, delete, and update the database\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EIncludes\u003C/strong\u003E: For your controllers \u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EViews\u003C/strong\u003E:  For your templates \u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cp\u003EYou also need \u003Ccode\u003Ehtaccess, functions.php and directories.php \u003C/code\u003Efiles inside the root folder. Htaccess will handle all URLs passed through the website and redirect them to the views folder. The directories.php file will define constants and autoload classes for us. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EHandle GET Requests Through the Htaccess File\u003C/h2\u003E\n\n\n\n\u003Cp\u003ETo start, we need to redirect all URL requests to one PHP file, which will handle all requests. To do this, we&#8217;ll use rewrite rules to redirect all requests to the \u003Ccode\u003Eviews/app.php\u003C/code\u003E file. \u003C/p\u003E\n\n\n\n\u003Cp\u003EAdd these lines of code in your .htaccess file on your root folder: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003E//Prevent direct access to sub-folders\nOptions -Indexes \n\nRewriteEngine on\n\n//Choose files users can access directly via the browser\nRewriteRule \\.(js|css|swf|jpg|gif|png|eot|tff|woff|woff2|map|wav|scss)(\\?|$) - &#91;NC,QSA,L] \n\n//Redirect the user request\nRewriteRule ^(.*)$ views/app.php?url=$1 &#91;NC,L,QSA]\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EThe code starts by disallowing users from viewing your files directly. Normally, when users navigate to a folder without the index file in PHP, they might see all files on your server. We obviously don&#8217;t want that. \u003C/p\u003E\n\n\n\n\u003Cp\u003EThey can only access select files via the browser. They are essential in the front-end, and the browser will download them automatically. \u003C/p\u003E\n\n\n\n\u003Cp\u003ELastly, the code rewrites all requests to the \u003Ccode\u003Eviews \u003E app.php\u003C/code\u003E file preventing direct access to the root folder. This can help secure your core files in the database, assets, and includes folder. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ECreate Your Router Class\u003C/h2\u003E\n\n\n\n\u003Cp\u003EThere are several steps to create a working router class, but they&#8217;re simple and easy to understand. We&#8217;ve broken down the steps into functions, so it&#8217;s easier for you to see what each one does. \u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EStep 1: Get the URL from the Browser\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIn your \u003Cstrong\u003Eincludes\u003C/strong\u003E folder, create a new folder called URL and a file inside it named \u003Ccode\u003Eurl.php.\u003C/code\u003E Inside the file create your class and add the following code:\u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003Efinal class url{\n \n private rawurl;\n private explodeurl;\n public table;\n public slug;\n\n\n  private function gettheurl(){\n\n        $rawurl         =   $_GET&#91;'url'];\n\n        $this-\u003Erawurl   =   cleanurl($rawurl);\n\n        return $this-\u003Erawurl;\n    }\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EThis is a private function that returns a valid URL. You can create a function \u003Ca href=\"https://www.phpsnaps.com/snaps/view/clean-url\"\u003Ecleanurl \u003C/a\u003Ein the \u003Cstrong\u003Efunctions.php \u003C/strong\u003Efile to filter illegal characters from the URL. We&#8217;ll show you how to link in another post. \u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EStep 2: Convert the URL into an Array\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIdealy, your MySQL database will have tables representing each post type on your app. For example, one table can hold data for \u003Cstrong\u003Epages, posts, users, tasks, or projects,\u003C/strong\u003E etc. We think this makes it easier to find your files on your database and to configure your URLs. \u003C/p\u003E\n\n\n\n\u003Cp\u003EIn most cases, pages URLs aren&#8217;t preceded by anything; you just type in the page slug directly into the URL. For instance, if you want to go to the contact page, you just type \u003Ccode\u003Eyourhost.com/contact\u003C/code\u003E, unlike for posts where you might type \u003Ccode\u003Eyourhost.com/post/category/post_slug\u003C/code\u003E. \u003C/p\u003E\n\n\n\n\u003Cp\u003EIn this tutorial we&#8217;ll assume that all URLs contain a reference to the post type (i.e., if you want to get the contact page, you key in \u003Ccode\u003Eyourhost.com/page/contact\u003C/code\u003E in your address bar.) \u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can remove option if you like. With that, let&#8217;s create a new private method similar to the one shown below: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003E\n    private function explodetheurl(){\r\n\r\n        $this-\u003Erawurl  =   $this-\u003Egettheurl();\r\n\r\n        $this-\u003Eexplodeurl     =   explode('/', $this-\u003Erawurl);\r\n\r\n        return $this-\u003Eexplodeurl;\r\n    }\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EThe function returns an array of the broken down URL. If your URL looks like this \u003Ccode\u003Epage/contact,\u003C/code\u003E you get an array that looks like \u003Ccode\u003EArray ( [0] =\u003E page [1] =\u003E contact )\u003C/code\u003E. \u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EStep 3: Sort Items Based on Tables and Slugs\u003C/h3\u003E\n\n\n\n\u003Cp\u003EAt this point, we want to assume three things: \u003C/p\u003E\n\n\n\n\u003Col\u003E\n\u003Cli\u003EIf returned array has no items, the user has requested for the homepage\u003C/li\u003E\n\n\n\n\u003Cli\u003EIf there&#8217;s only one item in the array, the user wants a list of all items in a table (i.e., the posts table)\u003C/li\u003E\n\n\n\n\u003Cli\u003EIf there&#8217;s a second item on the array, the user wants a specific item from a table\u003C/li\u003E\n\u003C/ol\u003E\n\n\n\n\u003Cp\u003EWith that, we can create methods to sort the array well to send to a class that&#8217;ll query the data from the database. We need to know which part is the table and which is the slug. \u003C/p\u003E\n\n\n\n\u003Cp\u003EWe created a method that looks like this: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003Eprivate function listquery(){\n\n        $this-\u003Eexplodeurl   =   $this-\u003Eexplodetheurl();\n\n        $this-\u003Etable        =   $this-\u003Eexplodeurl&#91;0];\n\n        if($this-\u003Etable === '') $this-\u003Etable = 'homepage'; \n\n        return $this-\u003Etable;\n    }\n\n private function singlequery(){\n\n        $this-\u003Eexplodeurl   =   $this-\u003Eexplodetheurl();\n\n        $this-\u003Etable        =   $this-\u003Eexplodeurl&#91;0];\n\n        $this-\u003Eslug         =   $this-\u003Eexplodeurl&#91;1];\n\n        return $this-\u003Etable;\n\n  }\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EBoth functions return the table name on MySQL, but we can still access the slug property throughout the class; we don&#8217;t have to return each property. This is just to make it easier to assign the methods to one variable in the future. \u003C/p\u003E\n\n\n\n\u003Cp\u003ETo get the table and slug from another class, you might call this method since both properties are public: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003Epublic function geturlpath(){\n        //We're fetching the data from the exploded url\n        $this-\u003Eexplodeurl   =   $this-\u003Eexplodetheurl();\n\n        $counturl     =   count($this-\u003Eexplodeurl);\n\n        if($counturl === 1){\n            //we're only getting the table because there's only one url\n            return $this-\u003Etable =   $this-\u003Elistquery();           \n        }\n\n        if($counturl === 2){\n\n            //we're getting the table and the action or the slug to show single item or params to search query\n            return $this-\u003Etable    =   $this-\u003Esinglequery();\n        }\n\n}\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EYou can now create another method that fetches the classes with the information regarding HTML templates and data from the database. \u003C/p\u003E\n\n\n\n\u003Cp\u003EFor example, we did something like this: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003Epublic function gotourl(){\n        //Get the table name and post slug\n        $table  =   $this-\u003Egeturlpath();\n        \n        //we can check if the user is logged in before querying the database\n        if(!isset($_SESSION&#91;'user_id'])){\n            $rq     =   new login;\n            //we'll need the information later to redirect the user to their page/post\n            return $rq-\u003Elogin($table, $this-\u003Eslug); \n        }\n\n        //we check if the user is logged in \n        if(isset($_SESSION&#91;'user_id'])){ \n            //Check if a file with the same name exists in the includes directory\n            if(file_exists('includes/logged_in/'.$table.'.php')){\n                $rq     =   new $table;\n                return $rq-\u003E$table($table, $this-\u003Eslug); \n            }       \n            return 'Class Doesn't Exist';\n        }\n}\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EAs you can see, we first check to see whether the user is logged in. We can use a different class to redirect them to the login, registration, email verification, and password change pages. \u003C/p\u003E\n\n\n\n\u003Cp\u003EIf the user is logged in, we call a class with the same name as the table to shorten our code. To do that, you&#8217;ll need the PHP autoloader function.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ECreate a PHP AutoLoader Function\u003C/h2\u003E\n\n\n\n\u003Cp\u003EYou don&#8217;t have to include a list of all your classes on the app.php file. The \u003Ca href=\"https://www.php.net/manual/en/function.spl-autoload-register.php\"\u003Espl_autoload_register()\u003C/a\u003E function can register any number of classes on your app. You just need to tell it where to look. \u003C/p\u003E\n\n\n\n\u003Cp\u003EIn your directories.php file, add the following code:\u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003E//Define the app root path so we don't have to keep checking this code\ndefine('root_path', $_SERVER&#91;\"DOCUMENT_ROOT\"].'/');\n\n//define the folders with your core files\n$def        =   array(\n    'assets'     =\u003E  root_path.\"assets/\",\n    'views'      =\u003E  root_path.\"views/\",\n    'ul'         =\u003E  root_path.\"includes/url\", \n    'db'         =\u003E  root_path.\"database/\", \n    'logged_out' =\u003E  root_path.\"includes/logged-out/\", \n    'logged_in'  =\u003E  root_path.\"includes/logged-in/\",\n);\n\nforeach ($def as $key =\u003E $value) {\n    define($key, $value);\n}\n\n//whenever you invoke a class, PHP will check these before it returns an error\nspl_autoload_register(\n    function($class){\n        global $def;\n        foreach ($def as $key =\u003E $value) {\n            if(file_exists(constant($key).\"$class.php\")){\n                return include constant($key).\"$class.php\";\n            }\n        }\n    }\n);\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EIn the above code, we&#8217;ve declared constants so you can use them to fetch files in the views and assets folders, and included the classes in the PHP autoloader function. \u003C/p\u003E\n\n\n\n\u003Cp\u003EThat means you only need to include the \u003Cstrong\u003E\u003Ccode\u003Edirectories.php\u003C/code\u003E\u003C/strong\u003E file on your app.php file, and your app should start running. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EInvoking the Class From Your App.php File\u003C/h2\u003E\n\n\n\n\u003Cp\u003ESince all URLs rewrite to \u003Cstrong\u003E\u003Ccode\u003Eviews \u003E app.php\u003C/code\u003E,\u003C/strong\u003E you must call the class and include the directories file. This is easy. Just add this to your app.php file: \u003C/p\u003E\n\n\n\n\u003Cpre class=\"wp-block-code\"\u003E\u003Ccode\u003E&lt;?php\r\n\r\ninclude_once '../directories.php';\ninclude_once '../functions.php';\r\n\r\n$url     =   new geturl;\r\n\r\n$url-\u003Egotourl();\u003C/code\u003E\u003C/pre\u003E\n\n\n\n\u003Cp\u003EThat is the only code you need on your app.php file, which will now act as your \u003Cstrong\u003Eindex.php file\u003C/strong\u003E. You can create classes in your app&#8217;s includes and database folders, but make sure to include the directories in the spl_autoload_register() function.\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EAre you looking for a way to hide your .PHP extension from the URL and secure your app. This article explores how you can create a custom router class to handle all your HTTP requests from the browser. Working with Routers When using a PHP framework, you map file paths in the address bar directly [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-cottonbro-studio-4709285.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [4],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3889"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3889"
          }
        ],
        "version-history": [
          {
            "count": 49,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3889/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3960,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3889/revisions/3960"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3894"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3889"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3889"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3889"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3878,
      "date": "2023-02-15T14:48:51",
      "date_gmt": "2023-02-15T14:48:51",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3878"
      },
      "modified": "2023-02-15T14:59:44",
      "modified_gmt": "2023-02-15T14:59:44",
      "slug": "cloud-computing-infrastructure-everything-you-need-to-know",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/cloud-computing-infrastructure-everything-you-need-to-know/",
      "title": {
        "rendered": "Cloud Computing Infrastructure"
      },
      "content": {
        "rendered": "\n\u003Cp\u003ECloud computing is renting a broad and complex infrastructure setup to provide cloud services and products to customers. It allows users to access resources like business applications, data storage, and networking solutions via the web.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ECloud computing requires a collection of hardware and software components called cloud computing infrastructure to work. The \u003Ca href=\"https://alexmuiruri.com/2022/10/28/how-are-cloud-storage-and-cloud-computing-different/\" data-type=\"post\" data-id=\"3544\"\u003Earchitectural framework of cloud computing\u003C/a\u003E mirrors a physical IT infrastructure with virtual machines and components such as servers, memory, storage, firewalls, load balances, and network switches. \u003C/p\u003E\n\n\n\n\u003Cp\u003EThis article will discuss why you should consider cloud infrastructure and the requirements for building one. We&#8217;ll also guide you on how to create and manage cloud infrastructure.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhy Cloud Infrastructure?\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-1024x682.jpg\" alt=\"\" class=\"wp-image-3880\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003ECloud infrastructure offers similar capabilities in private, public, and hybrid clouds as physical infrastructure but with added benefits.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe top business benefits of cloud computing infrastructure include the following:\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cstrong\u003EHigh Flexibility and Agility\u003C/strong\u003E: Cloud computing infrastructure gives organizations impeccable resources to incorporate new features and launch new services. Businesses can react to new market developments fast.&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003ELess Capital Investment\u003C/strong\u003E: You rent cloud infrastructure components from a cloud provider, eliminating upfront capital expenditure associated with traditional IT infrastructure. It follows a consumption-based model meaning that users only pay for the infrastructure they use.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EReduced Latency and Bandwith Expenses\u003C/strong\u003E:&nbsp;Cloud computing infrastructure brings data processing closer to users, increasing performance and reducing the bandwidth required on physical infrastructures.&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EImproved Overall Performance and Reliability\u003C/strong\u003E: Businesses are assured 100 percent uptime. Working with a trusted cloud partner allows businesses to free their resources to focus on generating new business.&nbsp;\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EComponents Of Cloud Infrastructure\u003C/h2\u003E\n\n\n\n\u003Cp\u003ECloud infrastructure has four main components, each well-integrated to form a single unit for efficient business operations.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThese include:&nbsp;\u003C/p\u003E\n\n\n\n\u003Cfigure class=\"wp-block-table\"\u003E\u003Ctable\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003EHardware\u003C/td\u003E\u003Ctd\u003EVirtualization\u003C/td\u003E\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003EHardware constitutes the physical machines, computers, and networking equipment used in cloud computing. It consists of servers, storage arrays, backup devices, and networking hardware such as switches, routers, firewalls, and load balancers.\u003C/td\u003E\u003Ctd\u003E\u003Ca href=\"#\"\u003EVirtualization and cloud computing\u003C/a\u003E work together. It separates hardware from IT services and operations. A hypervisor layers hardware resources to virtual machines, making sure they&#8217;re independent of one another.  The virtual machines are allocated into centralized pools for self-service and automated infrastructure management.\u003C/td\u003E\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003EStorage\u003C/td\u003E\u003Ctd\u003ENetwork\u003C/td\u003E\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003ECloud storage allows clients to store and control their data on remote servers.&nbsp; They can access the data via the internet and combine the data sources with other apps set up in the cloud.\u003C/td\u003E\u003Ctd\u003EThe network comprises wires, switches, and routers. A typical cloud network setup has several subnetworks with different visibility levels.&nbsp; Establishing VLANs and giving all network resources static or dynamic addresses is possible.&nbsp;\u003C/td\u003E\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003C/figure\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ECloud Infrastructure vs. a Cloud Architecture\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/chicago-geab596d9c_1280-1024x576.png\" alt=\"\" class=\"wp-image-3881\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/chicago-geab596d9c_1280-1024x576.png 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/chicago-geab596d9c_1280-300x169.png 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/chicago-geab596d9c_1280-768x432.png 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/chicago-geab596d9c_1280.png 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003ECloud architecture is the blueprint for cloud-based systems. It&#8217;s a set of best practices and principles for designing apps, platforms, or systems for the cloud. It determines how systems and hardware interact to support cloud computing.\u003C/p\u003E\n\n\n\n\u003Cp\u003ECloud infrastructure is the physical representation of the underlying \u003Ca href=\"#\"\u003Ecloud architecture\u003C/a\u003E. It facilitates cloud computing. Firms can build cloud infrastructure from scratch or utilize third-party cloud computing providers.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat Are the Requirements for Building a Cloud Infrastructure?\u003C/h2\u003E\n\n\n\n\u003Cp\u003E\u003Ca href=\"#\"\u003ECloud computing infrastructure requirements\u003C/a\u003E depend on business use cases. Here are some of the requirements:\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EHeterogeneous Systems\u003C/h3\u003E\n\n\n\n\u003Cp\u003ECloud infrastructure should be data-centric, reliable, and supportive. A cloud service provider should give users a conventional IT system to meet the key requirements of data centers.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EService Management\u003C/h3\u003E\n\n\n\n\u003Cp\u003EAn administrator should have access to a tool to help them establish and monitor performance. This comes from the service provider to instill resource management, billing cycles, and metering parameters.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EReliability and Security\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIt&#8217;s important that cloud computing businesses provide excellent support for the end user. Developers can use the cloud as a testing base for their latest versions to deliver accurate and precise functions. Data should remain intact, and despite the resources being shared, only authorized users should have access to the data.&nbsp;&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EPublic vs. Private vs. Hybrid Cloud Architectures\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"732\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/hosting-g44407d557_1280-1024x732.png\" alt=\"\" class=\"wp-image-3883\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/hosting-g44407d557_1280-1024x732.png 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/hosting-g44407d557_1280-300x214.png 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/hosting-g44407d557_1280-768x549.png 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/hosting-g44407d557_1280.png 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EThere are 3 \u003Ca href=\"https://alexmuiruri.com/2022/10/28/how-are-cloud-storage-and-cloud-computing-different/\" data-type=\"post\" data-id=\"3544\"\u003Ecloud computing architectures\u003C/a\u003E: public, private, and hybrid.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EPublic Cloud&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EA third party owns the cloud infrastructure components in public cloud architecture, and clients share in multi-tenant deployments.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ECustomers do not own or manage the primary infrastructure resources, such as CPU cycles, storage, and bandwidth. They pay for services and abilities based on these critical infrastructural resources.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EPrivate Cloud&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIn a private cloud, a company typically constructs, owns, and stores the cloud infrastructure components in a data center. A one-tenant environment implies. The owner utilizes unique resources and services.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis design combines the flexibility and convenience of virtualized services with the effective management, security, and control that come with data center ownership.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EHybrid cloud&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EA hybrid cloud combines the two concepts of public and private cloud to create a solitary logical environment. A company can use a private cloud to operate specific workloads and sensitive information or a public cloud to run other apps and store data.\u003C/p\u003E\n\n\n\n\u003Cp\u003EPublic cloud services can also address spikes or bursts in demand to offer flexibility for personal cloud use.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EPros &amp; Cons of Cloud Infrastructure\u003C/h2\u003E\n\n\n\n\u003Cp\u003EThe following are some of the advantages and disadvantages of adopting cloud infrastructure.\u003C/p\u003E\n\n\n\n\u003Cfigure class=\"wp-block-table\"\u003E\u003Ctable\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003EPros\u003C/td\u003E\u003Ctd\u003ECons\u003C/td\u003E\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003EIt enhances collaboration, improves business processes, and increases workforce productivity. It reduces IT costs and capital expenditures. It provides the flexibility to scale up and down as required. It offers users a high level of security, privacy, and control. It enables the management of the entire IT environment from one centralized location.\u003C/td\u003E\u003Ctd\u003EThe vendor lock may cause the user to become vulnerable to vendor-specific security issues and reduce supportability. Cloud users have limited control over their data and applications. The user may experience performance degradation on public clouds.\u003C/td\u003E\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003C/figure\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EHow To Create A Cloud Infrastructure\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"695\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/frankfurt-g0195d1386_1280-1024x695.jpg\" alt=\"\" class=\"wp-image-3884\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/frankfurt-g0195d1386_1280-1024x695.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/frankfurt-g0195d1386_1280-300x204.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/frankfurt-g0195d1386_1280-768x521.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/frankfurt-g0195d1386_1280.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EThe following are some of the steps involved in creating a cloud computing strategy:\u003C/p\u003E\n\n\n\n\u003Col\u003E\n\u003Cli\u003EDecide the foundational cloud computing vs. on-premise technology for your on-demand application infrastructure.\u003C/li\u003E\n\n\n\n\u003Cli\u003ESelect the delivery infrastructure to utilize to abstract the application infrastructure.\u003C/li\u003E\n\n\n\n\u003Cli\u003ESet up the network infrastructure to ensure seamless data transfer between the application and the cloud infrastructure.\u003C/li\u003E\n\n\n\n\u003Cli\u003EOffer visibility and automate&nbsp;managerial responsibilities to improve the quality of service delivered by the cloud infrastructure and keep track of your resource&#8217;s requirements.\u003C/li\u003E\n\n\n\n\u003Cli\u003EIntegrate all the moving elements to enable&nbsp;the infrastructure to reap&nbsp;the rewards of automation, virtualization, and resource sharing.\u003C/li\u003E\n\u003C/ol\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EHow To Manage A Cloud Infrastructure\u003C/h2\u003E\n\n\n\n\u003Cp\u003EHere are some tips for managing cloud infrastructure:\u003C/p\u003E\n\n\n\n\u003Col\u003E\n\u003Cli\u003EUse&nbsp;a dashboard that presents aggregated consumption patterns and total spending across all cloud subscriptions, giving an executive-level view of the utilization of cloud resources.\u003C/li\u003E\n\n\n\n\u003Cli\u003ETo prevent overspending and underutilization of cloud capacity, keep track of the costs and usage of cloud services across all departments.\u003C/li\u003E\n\n\n\n\u003Cli\u003ESkillfully bargain for volume discounts and rationalize cloud instance utilization.\u003C/li\u003E\n\n\n\n\u003Cli\u003EBy centralizing cloud service management, you may make an IT shift to a service-based organization easier while lowering costs, reducing overhead, and allowing chargeback of cloud services.\u003C/li\u003E\n\n\n\n\u003Cli\u003ETo cut costs, maximize the use of pre-paid capacity.\u003C/li\u003E\n\u003C/ol\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EFinal Takeaway\u003C/h2\u003E\n\n\n\n\u003Cp\u003ECloud infrastructure is critical in today&#8217;s IT environment as it enhances flexibility and scalability. Top brands provide amicable solutions to help you reduce your heavy computing and high bandwidth costs.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EFind one that offers managed support from start to end, so you don&#8217;t have to waste time configuring and maintaining your dedicated server to use it.&nbsp;\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003ECloud computing is renting a broad and complex infrastructure setup to provide cloud services and products to customers. It allows users to access resources like business applications, data storage, and networking solutions via the web.&nbsp; Cloud computing requires a collection of hardware and software components called cloud computing infrastructure to work. The architectural framework of [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-1024x682.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3878"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3878"
          }
        ],
        "version-history": [
          {
            "count": 4,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3878/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3888,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3878/revisions/3888"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3880"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3878"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3878"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3878"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3869,
      "date": "2023-02-11T20:18:59",
      "date_gmt": "2023-02-11T20:18:59",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3869"
      },
      "modified": "2023-02-11T20:24:27",
      "modified_gmt": "2023-02-11T20:24:27",
      "slug": "node-js-vs-javascript",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/node-js-vs-javascript/",
      "title": {
        "rendered": "Node Js vs JavaScript "
      },
      "content": {
        "rendered": "\n\u003Cp\u003EWe think of JavaScript when designing a dynamic and interactive website and Node Js for backend development. Since JavaScript is great for front-end development, many people are curious about its capabilities on the server side.\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, it&#8217;s good to note that JavaScript and Node Js differ. While Javascript is a front-end language, Node Js is a runtime environment that allows JavaScript to run on the server side.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIn this article, we uncover the fundamental differences between JavaScript and Node Js to help you determine how you can utilize them to code faster.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ETL;DR &#8211; Node Js vs JavaScript&nbsp;\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-330771-1024x682.jpg\" alt=\"\" class=\"wp-image-3871\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-330771-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-330771-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-330771-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-330771.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EIt&#8217;s good to note that Node Js is not an alternative to Javascript, and you can&#8217;t use it to build front-end applications. However, Node Js can help you run Javascript outside your browser. This means it&#8217;s cross-platform, and you can build mobile apps, websites, and computer applications that rely on the same database as Node Js.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat is JavaScript?\u003C/h2\u003E\n\n\n\n\u003Cp\u003EJavaScript is a lightweight development language that creates dynamic HTML webpages containing interactive effects. It was first introduced in 1995 as a client-side object-oriented programming language for client-side web development.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EBecause it&#8217;s a client-side language, JavaScript does not require downloading and running source code on the server. All browsers, i.e. Mozilla, Chrome, Safari, and even IE/Edge, provide a runtime environment for JavaScript. Chrome&#8217;s V8 Engine and Mozilla&#8217;s SpiderMonkey Engine are just two examples.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThis allows programmers to start coding immediately without installing any applications. However, the downside is that it cannot run outside a browser &#8212; like on a server.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat is Node Js?\u003C/h2\u003E\n\n\n\n\u003Cp\u003ENode.js is a JavaScript runtime environment that allows it to run JS on the server side. It is a cross-platform runtime, first introduced in 2009 to run on Google&#8217;s v8 engine and be executed outside the browser.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt&#8217;s an environment or interpreter that can run any JavaScript program. It enables you to carry out server-side functions such as creating a database, fetching data from the server, and storing user data.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ENode Js has many modules, but it&#8217;s not a programming language but an environment that works with JavaScript to allow developers to write simple, scalable code easily. It offers many related libraries commonly used as a general-purpose programming language in JavaScript.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat Is the Main Difference Between Javascript and Node JS?\u003C/h2\u003E\n\n\n\n\u003Cp\u003EHere&#8217;s a table comparing Javascript and Node Js\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EJavaScript\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003ENode.js\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EHow it works\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EWe primarily use JS to create scripts that make web pages dynamic and more interactive.\u003C/p\u003E\n\n\n\n\u003Cp\u003EHelps us run JavaScript scripts in the server-side environments\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EWhen to use it?\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EUsed exclusively within browsers\u003C/p\u003E\n\n\n\n\u003Cp\u003EPermits running JavaScript outside browser environments.\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EWhy use\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EWhile the burden is being distributed, you can develop an application and execute numerous threads.\u003C/p\u003E\n\n\n\n\u003Cp\u003EIt employs two sorts of threads: the main thread, which is handled by the event loop, and multiple other threads.\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EPopularity\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EFront-end Development\u003C/p\u003E\n\n\n\n\u003Cp\u003EFront-end Development\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003ELearning curve\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003ESteep\u003C/p\u003E\n\n\n\n\u003Cp\u003EShallow with an understanding of JavaScript\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EExample app\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EHibernate, Struts, Spring, Tapestry, JSF, etc.\u003C/p\u003E\n\n\n\n\u003Cp\u003EPartial.js, Socket.io, Sails.js, Express.js, etc.\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003ELicense\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EJava virtual machine\u003C/p\u003E\n\n\n\n\u003Cp\u003EV8 engine from Google\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003ECurrent Version\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe latest Javascript version is ES2015\u003C/p\u003E\n\n\n\n\u003Cp\u003ENode Js current version is v16.9.0\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat is Node Js?&nbsp;\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-360591-1024x682.jpg\" alt=\"\" class=\"wp-image-3873\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-360591-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-360591-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-360591-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-markus-spiske-360591.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EHere are some FAQs about Node JS\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs Node Js a Programming Language?\u003C/h3\u003E\n\n\n\n\u003Cp\u003ENode.js is developed in JavaScript, C, and C++. It is described as &#8220;a bundled compilation of a libuv platform abstraction layer, Google&#8217;s V8 JavaScript engine, and a basic library mostly written in JavaScript.\u003C/p\u003E\n\n\n\n\u003Cp\u003ENode.js cannot be defined as a programming language. Rather, it is a runtime environment that allows JavaScript to be executed outside the browser on a server. It&#8217;s also not a framework. The runtime environment is constructed on top of JavaScript and aids in the execution of frameworks. Therefore, Node.js is not a programming language or a framework; it is an ecosystem for them.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs Node JS Backend?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EOne prevalent misperception among developers is that Node.js is exclusively used for backend frameworks and server-side applications. This is incorrect: Node.js can be used on both the front and backend.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe event-driven, asynchronous nature of Node.js frameworks makes them a popular choice for developers designing a flexible and scalable backend. Frontend developers, on the other hand, will see the rewards of Node.js in their workflows just as vividly. You can build REST API applications that can be used in both the front-end and back-end.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EHow Does Node Js Work?\u003C/h3\u003E\n\n\n\n\u003Cp\u003EHere&#8217;s how Node Js works:Node.js receives the request from the client side and sends the response.\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003ESingle threads handle the requests to perform I/O operations or requests\u003C/li\u003E\n\n\n\n\u003Cli\u003EA thread is a sequence of commands that the server must execute. It works in tandem with the server to serve numerous clients simultaneously.\u003C/li\u003E\n\n\n\n\u003Cli\u003ENode.js is a single-threaded event loop programming language, therefore, It handles multiple requests concurrently on a single thread while not blocking it for a single request.&nbsp;\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EWhen To Use Node Js?\u003C/h3\u003E\n\n\n\n\u003Cp\u003EIt is undeniable that Node.js has practically established the groundwork for the real-time web. Online apps with real-time, two-way communication have transformed the traditional web response paradigm. However, JavaScript is not best for creating applications that require heavy calculations. It&#8217;s best to retrieve data from databases and return values, files, and data to the user.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EWhy Use Node Js?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003ECommon reasons why people use Node Js include:&nbsp;\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003EA CPU-Heavy Application usage: Implementing Node.js Is Generally a Bad Idea in this case&nbsp;since Node.js uses an event-based, non-blocking I/O architecture on a single CPU. Thus all extra heavy Multiprocessor action will effectively block any user request.\u003C/li\u003E\n\n\n\n\u003Cli\u003ENode.js is redundant in a simple CRUD (or HTML) application when data is delivered directly by the server, and there is no need for a separate API.\u003C/li\u003E\n\n\n\n\u003Cli\u003EA Server-Side Relational Database App, since its relational data tools aren&#8217;t as dependable, or robust and easy to work with as other runtime toolboxes&nbsp;\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs Node Js Popular?\u003C/h3\u003E\n\n\n\n\u003Cp\u003ENode.js has been downloaded over a billion times globally because it is easy to learn and scale your Node.js knowledge. It is fast, cross-platform, and mobile-friendly; hence Mobile developers love it not only for its speed and extensibility but also because of its high caching ability.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs Node Js Easy To Learn?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EYou need to learn JavaScript to write code on Node Js. As a result, web developers can easily manipulate data from the database using Node Js and develop more appealing sites. Learning Node.js takes less effort and time.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003ENode Js Application Example\u003C/h3\u003E\n\n\n\n\u003Cp\u003EStreaming app Netflix, Social media network LinkedIn, FinTech apps like JUspay, and online stores like eBay use Node.js\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003ENode Js License\u003C/h3\u003E\n\n\n\n\u003Cp\u003ENode Js uses an open-source MIT licence that applies to all parts of the module that are not externally maintained\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003ENode Js Current Version\u003C/h3\u003E\n\n\n\n\u003Cp\u003ENode Js current version is v16.9.0\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EWhat Is JavaScript?&nbsp;\u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-sora-shimazaki-5926389-1024x682.jpg\" alt=\"\" class=\"wp-image-3875\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-sora-shimazaki-5926389-1024x682.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-sora-shimazaki-5926389-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-sora-shimazaki-5926389-768x512.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-sora-shimazaki-5926389.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EHere are some FAQs on JavaScript:&nbsp;&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs JavaScript a Programming Language?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EOn the other hand, JavaScript is a scripting or programming language that allows you to implement complex features on web pages. It involves making websites more lively, collecting user data, and changing HTML attributes which are often static. Javascript also helps display timely content updates, visualizations, animatronic 2D/3D graphics, etc.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs JavaScript Frontend or Backend?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJavaScript can be either frontend or backend with the help of Node Js. A host environment hosts JavaScript, the most prevalent is a browser. It&#8217;s the front-end in that situation. However, because there are now multiple server host environments, JavaScript could run on the backend.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EHow Does JavaScript Work?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EHere&#8217;s how JavaScript works:\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003EJavaScript is not a compiled language. Rather; it is an interpreted language. Unlike most other languages, Javascript does not need to be compiled like C++ and Java\u003C/li\u003E\n\n\n\n\u003Cli\u003EIt&#8217;s a single-threaded language, meaning that it can only do one thing at a time or a piece of code at a time&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003EWhen a browser encounters a JavaScript code encoded inside a &lt;script&gt;&lt;/script&gt; tag, it sends the data to the Javascript engine inside the browser&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003EThe engine will first execute all code that&#8217;s not inside a function\u003C/li\u003E\n\n\n\n\u003Cli\u003EEvery time you call a function, the engine creates a new Function Execution Context to run the function. So if many functions are being called, the code will create several FECs\u003C/li\u003E\n\n\n\n\u003Cli\u003EJavascript will then execute all the code and update the variables with actual values\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EWhen To Use JavaScript?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJavaScript, on the other hand, makes it easy to create dynamic web applications with which users can interact without reloading the page every time. The DOM API frequently uses JavaScript to modify HTML and CSS to update a user interface dynamically. It is most commonly found in web applications.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EWhy Use Javascript?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EHere are some reasons why you should consider JavaScript\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003EJavaScript&nbsp;is often used to create web pages and enables us to add dynamic characteristics and special features to the site.\u003C/li\u003E\n\n\n\n\u003Cli\u003EIt is generally used for validation because it allows you to conduct complex operations on the front-end&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003EYou can also use AJAX to call functions from other programming languages and upload data to the database dynamically\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EIs JavaScript Popular?&nbsp;\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJavaScript is the world&#8217;s most popular programming language, so it&#8217;s no surprise that it&#8217;s one of the most in-demand skills in the software industry today. As per the Devskiller IT Skills and Hiring Report 2020, 72% of firms want to recruit JavaScript expertise.\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EJavaScript Application Example\u003C/h3\u003E\n\n\n\n\u003Cp\u003EEvery website on the internet uses a bit of JavaScript on their website. We use JavaScript to give interactive and dynamic information.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EJavaScript License\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJavascript uses GNU Public License, GNU Lesser, General Public License\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003ECurrent JavaScript Version\u003C/h3\u003E\n\n\n\n\u003Cp\u003EThe current JavaScript version is ES2015&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ESummary &#8211; Is Node Js the Same as JavaScript?\u003C/h2\u003E\n\n\n\n\u003Cp\u003EAlthough Node Js require JavaScript, they are not similar. You can compare JavaScript and Node Js to your engine and car &#8212; although your car is synonymous with its engine, the engine does not require a car to run, and it can also be used to power other things effectively.\u003C/p\u003E\n\n\n\n\u003Cp\u003ESo just like your car engine, JavaScript can be used to build applications outside Node Js. But just like your car without an engine, you cannot use Node Js without JavaScript. Therefore, Javascript is the engine in Node Js.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E&nbsp;Is NodeJS Syntax the Same as JavaScript?\u003C/h3\u003E\n\n\n\n\u003Cp\u003ENode Js and Javascript use the same syntax. However, JavaScript is a high-level programming language used to create website scripts, while NodeJS is a JavaScript runtime environment. So, even if the code looks similar, it&#8217;s used to run different applications.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003E&nbsp;Is Node Js Better Than JavaScript?\u003C/h3\u003E\n\n\n\n\u003Cp\u003EJavaScript is a popular programming language used by practically every application developer. It is fairly simple to find a resource on the subject and begin working with JavaScript and doing some basic development.\u003C/p\u003E\n\n\n\n\u003Cp\u003ENode.js is a JavaScript library extension, but it also includes unspecified services. Some, like the non-blocking operating system operation, are used by companies to develop technologies to meet their objectives. If you need Node Js developers to help make your project a reality, \u003Ca href=\"https://hi.brainhub.eu/contact\"\u003Econtact us \u003C/a\u003Efor information on how you can get your project started.&nbsp;\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EWe think of JavaScript when designing a dynamic and interactive website and Node Js for backend development. Since JavaScript is great for front-end development, many people are curious about its capabilities on the server side. However, it&#8217;s good to note that JavaScript and Node Js differ. While Javascript is a front-end language, Node Js is [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/02/technology-ga6a9634c2_1280-1024x682.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3869"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3869"
          }
        ],
        "version-history": [
          {
            "count": 3,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3869/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3876,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3869/revisions/3876"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3871"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3869"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3869"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3869"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3819,
      "date": "2023-02-07T10:12:56",
      "date_gmt": "2023-02-07T10:12:56",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3819"
      },
      "modified": "2023-02-10T16:48:52",
      "modified_gmt": "2023-02-10T16:48:52",
      "slug": "the-ultimate-guide-to-banking-safely-in-gibraltar-in-2023",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/the-ultimate-guide-to-banking-safely-in-gibraltar-in-2023/",
      "title": {
        "rendered": "The Ultimate Guide to Banking in Gibraltar"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EIn this article, we discuss banking in Gibraltar. We&#8217;ll uncover the advantages of opening a bank in Gibraltar, why Gibraltar banks might interest you, and who can benefit from banking in Gibraltar the most.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ESince Gibraltar&#8217;s banking sector underwent a massive overhaul to eliminate tax loopholes and shed its tax haven status in the past years, we also discuss whether banks in Gibraltar might still save you on taxes.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ELooking for a plan to solve your offshore puzzle? Nomad Capitalist can help you go offshore, achieve your dream lifestyle, and enjoy unprecedented global freedom. Apply to \u003Ca href=\"https://nomadcapitalist.com/apply/\"\u003Ebecome a client today\u003C/a\u003E.\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EGibraltar Overview \u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image\"\u003E\u003Cimg decoding=\"async\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-daniel-nouri-10135272-1024x682.jpg\" alt=\"\"/\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EGibraltar is a British overseas territory occupying a narrow peninsula of Spain’s Mediterranean coast. The territory has a small population of about 32,000 people. 80% of them are Gibraltarians, children of people born in Gibraltar before 1925, and the rest are aliens and families of British military personnel.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EGibraltar has been a symbol of British naval strength since the 18th century. Banking is a pillar of the economy, although just over 10 banks are here. There are no agricultural activities on the land since there&#8217;s no space. The territory occupies a 3-mile by 0.75-mile piece of land.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe British military garrison and naval dockyard play an integral part in Gibraltar’s economy, and its naval operations often use the port’s facilities. When the Suez Canal opened in 1869, Gibraltar greatly increased its significance as a provisioning port.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EToday, its main sources of income are ships and military personnel provisioning, re-export trade, and tourism. Its cultural and legal systems are similar to the UK&#8217;s, and the Gibraltar Financial Services Commission supervises all banks. It also uses Pound Sterling currency.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EGibraltar is a long-established center for international banking. The wealthy have flocked here for decades for low taxes, banking, and asset protection. The government tried imposing more rigid financial regulations to reduce tax loopholes and ensure transparency and international cooperation.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe territory is still a low-tax jurisdiction even after the EU Savings Tax Directive in 2010. Investors still enjoy low capital gains, inheritance, and corporate taxes, and Gibraltar banks offer the EU deposit protection of €100,000. Gibraltar-based banks constitute large global institutions, private and investment banks, and building societies.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003ESources\u003C/h2\u003E\n\n\n\n\u003Col\u003E\n\u003Cli\u003E\u003Ca href=\"https://www.gibraltar.gov.gi/finance-gaming-and-regulations/gibraltar-finance\"\u003Ehttps://www.gibraltar.gov.gi/finance-gaming-and-regulations/gibraltar-finance\u003C/a\u003E\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://www.worldoffshorebanks.com/Gibraltar_banks_and_banking_system.php\"\u003Ehttps://www.worldoffshorebanks.com/Gibraltar_banks_and_banking_system.php\u003C/a\u003E\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://en.wikipedia.org/wiki/List_of_banks_in_Gibraltar\"\u003Ehttps://en.wikipedia.org/wiki/List_of_banks_in_Gibraltar\u003C/a\u003E\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://www.gibraltarfinance.gi/banking\"\u003Ehttps://www.gibraltarfinance.gi/banking\u003C/a\u003E\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://www.youtube.com/watch?v=P-YFcDdRMso&amp;ab_channel=GlobalBanks\"\u003Ehttps://www.youtube.com/watch?v=P-YFcDdRMso&amp;ab_channel=GlobalBanks\u003C/a\u003E\u003C/li\u003E\n\u003C/ol\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EIn this article, we discuss banking in Gibraltar. We&#8217;ll uncover the advantages of opening a bank in Gibraltar, why Gibraltar banks might interest you, and who can benefit from banking in Gibraltar the most.&nbsp; Since Gibraltar&#8217;s banking sector underwent a massive overhaul to eliminate tax loopholes and shed its tax haven status in the past [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-daniel-nouri-10135272-1024x682.jpg",
      "comment_status": "open",
      "ping_status": "open",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [23],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3819"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3819"
          }
        ],
        "version-history": [
          {
            "count": 4,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3819/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3863,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3819/revisions/3863"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3820"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3819"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3819"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3819"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3814,
      "date": "2023-01-26T14:56:34",
      "date_gmt": "2023-01-26T14:56:34",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3814"
      },
      "modified": "2023-02-10T16:39:15",
      "modified_gmt": "2023-02-10T16:39:15",
      "slug": "is-there-a-way-to-avoid-stamp-duty",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/is-there-a-way-to-avoid-stamp-duty/",
      "title": {
        "rendered": "Is There a Way to Avoid Stamp Duty?"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EWhile many new property owners may want to avoid stamp duty on second homes, the option is not&nbsp;feasible&nbsp;for everyone.&nbsp;Avoiding stamp duty might lead to an HMRC investigation into tax avoidance or evasion.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EStill, there are ways to reduce or avoid stamp duty tax liability.&nbsp;In some cases, the exceptions are straightforward, like buying a low-valued home for the first time. Sometimes you must tread&nbsp;carefully&nbsp;to avoid getting in trouble with the HMRC.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EWhat is Stamp Duty?&nbsp;\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-full\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/01/45841713292_b68085814e_b.jpg\" alt=\"\" class=\"wp-image-3815\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/01/45841713292_b68085814e_b.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/01/45841713292_b68085814e_b-300x200.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/01/45841713292_b68085814e_b-768x512.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EIs there a way to avoid stamp duty? Image via Flickr by \u003Ca href=\"https://www.flickr.com/photos/housebuyfastworthing/45841713292/sizes/c/\"\u003EHouse Buy Fast\u003C/a\u003E. \u003Cstrong\u003E\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EStamp Duty Land Tax (SDLT) is a \u003Ca href=\"https://www.gov.uk/stamp-duty-land-tax\"\u003Egovernment tax\u003C/a\u003E you pay when purchasing a property or land over a certain amount in England and Northern Ireland.\u003C/p\u003E\n\n\n\n\u003Cp\u003EThe current threshold is £250,000 for residential and £150,000 for commercial land and properties. This means you don&#8217;t pay stamp duty for homes priced below that price.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou&#8217;ll pay stamp duty for the following:&nbsp;\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003ELeasehold property: property that sits on land that&#8217;s on lease\u003C/li\u003E\n\n\n\n\u003Cli\u003EFreehold property: property that sits on the land you own\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Ca href=\"https://www.gov.uk/stamp-duty-land-tax/shared-ownership-property\"\u003EShared ownership scheme\u003C/a\u003E property\u003C/li\u003E\n\n\n\n\u003Cli\u003ELand or property transferred to you as inheritance, shares in something, or settlement\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cp\u003EYou still pay stamp duty even if you buy a home through a mortgage or cash.&nbsp;So, when budgeting for your next home or buy-to-rent investment, factor in stamp duty charges.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EHow Much is Stamp Duty&nbsp;\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf you&#8217;re a first-time home buyer, you might get away with reduced rates or paying no stamp duty.&nbsp;However, you cannot avoid paying stamp duty for second homes unless your property is below the threshold.\u003C/p\u003E\n\n\n\n\u003Cp\u003EStamp duty thresholds differ depending on whether you&#8217;re buying the property in England, Northern Ireland, \u003Ca href=\"https://www.gov.wales/land-transaction-tax-guide\"\u003EWales\u003C/a\u003E, or \u003Ca href=\"https://www.gov.scot/policies/taxes/\"\u003EScotland\u003C/a\u003E or if you&#8217;re a UK citizen.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ECalculate the current stamp duty amounts for first-time \u003Ca href=\"https://www.gov.uk/stamp-duty-land-tax/residential-property-rates\"\u003Eresidential property buyers\u003C/a\u003E as follows:\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cstrong\u003EEngland and NI\u003C/strong\u003E:&nbsp;0% for the first £425,000, plus 5% for the next £625,000, plus 10% for the next £575,000, and 12% for the remaining&nbsp;portion&nbsp;above £1.5 million.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EWales\u003C/strong\u003E:&nbsp;0% for the first £225,000, plus 6% for the next £175,000, plus 7.5% for the next £350,000, plus 10% within the next band up to £1.5 million, and 12% over that.\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EScotland\u003C/strong\u003E: 0% for the first £175,000, plus a normal percentage for property values above that. This means you save £600 from your normal charges.&nbsp;\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cp\u003EFor second homes, your stamp duty thresholds will be as follows:&nbsp;\u003C/p\u003E\n\n\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cstrong\u003EEngland and NI\u003C/strong\u003E: You pay&nbsp;3% for homes valued up to £250,000, 8% for the next £675,000, 13% for the next £575,000, and 15% for properties over £1.5million.&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EWales\u003C/strong\u003E: You pay&nbsp;4% for homes valued up to £145,000, 6% for the next £105,000, 9% for the next £75,000, 14% for the next £425,000, and 16% for properties over £750,000.&nbsp;\u003C/li\u003E\n\n\n\n\u003Cli\u003E\u003Cstrong\u003EScotland\u003C/strong\u003E: You pay 7.5% for homes valued between £180,001 and £250,000, 9% for those ranging from £250,001 and £400,000, 11.5% for those between £400,001 and £750,000, 14% for those between £750,001 and £1.5m, and 16% for homes valued over £1.5m.\u003C/li\u003E\n\u003C/ul\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EIs There a Way to Avoid Stamp Duty?&nbsp;\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EStamp duty can make buying a home quite expensive.&nbsp;However, it&#8217;s often unavoidable, and you must pay tax as part of the property&nbsp;purchase.\u003C/p\u003E\n\n\n\n\u003Cp\u003EStill, there are tips to reduce or avoid paying the stamp duty. These include:&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E1. Buy a Cheaper Property\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EHomes worth under £125,000 aren&#8217;t subject to stamp duty tax. So, the simplest way to avoid it is by investing in cheaper properties that don&#8217;t meet this threshold.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EThere are several ways to do this. You can search for houses marketed for less than £250,000, even outside your area of preference.&nbsp;You can also consider different bandings, as lower bands&nbsp;typically&nbsp;translate to lower stamp duty.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EMany agents know that thresholds make a difference to potential buyers.&nbsp;Rather than marketing houses at £250,000, they&#8217;ll lower the price to about £249,995, as this remains in the first tier of stamp duty.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E2. Bargain on the Property Price\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EAnother great way to avoid stamp duty is by bargaining the property&#8217;s asking price. A lower asking price can help you avoid a higher tax band.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can also negotiate with the property seller to split the cost of the stamp duty with you.&nbsp;Some sellers will reduce the cost of the property&nbsp;proportionately&nbsp;to help you cover the costs.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E3. Get another person to become a first-time buyer\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003ESuppose you&#8217;re buying a second property for a family member or friend. You can avoid paying second home stamp duty by using their names on the deed.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EFor a relative, you can gift them money for the house deposit.&nbsp;If they pass the requirements for a mortgage, the property will&nbsp;be registered&nbsp;under their names. It might remain their primary&nbsp;residence, but it&#8217;ll also be your second home.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can also sign for a family member&#8217;s mortgage or loan as a guarantor. You won&#8217;t be the legal owner of the property, but it can be useful as your second home.\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, you&#8217;re liable for covering the mortgage repayments if your family member cannot pay for themselves.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E4. Transfer a property\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf someone transfers a property to you mortgage-free, either as a gift or inheritance, you don&#8217;t need to pay stamp duty for the property&#8217;s market value.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EAlternatively, if you split up with your spouse or civil partner, you can buy their share of your jointly-owned home.&nbsp;However, if you take responsibility for the mortgage for the property, you might also need to pay for stamp duty.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E5.&nbsp;Purchase&nbsp;A Mobile Home\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EMobile homes such as caravans and houseboats can be a great alternative to physical property. They&#8217;re also a great way to avoid stamp duty, as you&#8217;re not liable to pay any.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, this might not be viable for people looking to invest in buy-to-let properties. Finding tenants for mobile homes is harder than other forms of housing.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E6. Pay for fixtures and fittings&nbsp;separately\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003ERemovable fixtures and fittings such as carpets, curtains, ovens, and furniture are not subject to stamp duty taxation. You can ask the property seller to pay for them&nbsp;separately&nbsp;to lower the property price.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EOnce you agree with the seller on a reasonable sum, subtract the amount from the&nbsp;purchase&nbsp;price.&nbsp;However, it&#8217;s good to seek advice from a competent lawyer or conveyancer to avoid getting in trouble with the HMRC.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E7. Build your own\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf you&#8217;re a DIY enthusiast, you might enjoy custom-designing your house. This can prove cost-effective, as buying a piece of land without a building permit is much cheaper.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou only pay for the stamp duty for the piece of land rather than the value of the finished property.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E8.&nbsp;Purchase&nbsp;a buy-to-let as a first-time buyer\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EBuy-to-lets are often considered second homes and charged second-home stamp duty&nbsp;accordingly.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou won&#8217;t have to pay for second-home stamp duty if you&#8217;re a \u003Ca href=\"https://themortgagereports.com/76236/who-qualifies-first-time-home-buyer\"\u003Efirst-time buyer\u003C/a\u003E. You might also qualify for first-time buyer stamp duty rates.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, if you buy the buy-to-let with someone who&#8217;s not a first-time buyer, you&#8217;ll&nbsp;be treated&nbsp;as a single unit, so you&#8217;re liable for second-time stamp duty.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E9. Take advantage of Stamp duty holidays\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EOccasionally, the government increases the threshold for stamp duty. For instance, there was a stamp duty holiday from July 2020 to March 2021 across the UK.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou&#8217;d pay no stamp duty if your home&nbsp;were valued&nbsp;at less than £500,000 in England and Northern Ireland and £250,000 in Scotland and Wales. This often translates into a lot of savings for property buyers.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003E10. Claim back stamp duty&nbsp;\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003ESometimes, you might&nbsp;be entitled&nbsp;to a stamp duty tax refund.&nbsp;For example, if you bought a new home while still waiting to sell your primary&nbsp;residence, you can claim back some of the higher rate stamp duty tax.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf you sell your home within three years of purchasing another, submit a stamp duty tax refund within three years of making that sale to get a tax refund.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EHowever, you cannot get a refund if your original property exceeds the three-year limit.&nbsp;When submitting your form, include information&nbsp;regarding&nbsp;both properties, the property you&#8217;re selling, and the amount you&#8217;d like to claim.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003E\u003Cstrong\u003EConclusion: Is There a Way to Avoid Stamp Duty?&nbsp;\u003C/strong\u003E\u003C/p\u003E\n\n\n\n\u003Cp\u003EDespite the mounted efforts by politicians to switch liability for stamp duty from buyers to sellers, there&#8217;s no sign of that happening soon.\u003C/p\u003E\n\n\n\n\u003Cp\u003EWhile looking for ways to avoid stamp duty, be careful not to fall for \u003Ca href=\"https://www.gov.uk/guidance/stamp-duty-land-tax-avoidance-misleading-advertising-spotlight-43\"\u003Estamp-duty mitigation schemes\u003C/a\u003E. The HMRC scrutinizes all sales where the sale price is at or just below the threshold of stamp duty.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EIf you underprice fixtures and fittings, you could face charges for fraudulent attempts to tax evasion.\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EStamp duty can make a property quite expensive. So, most buyers will ask, &#8220;Is there a way to avoid stamp duty?&#8221; Read on to find 10 tips to avoid it.\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/02/pexels-daniel-nouri-10135272-1024x682.jpg",
      "comment_status": "closed",
      "ping_status": "closed",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [23],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3814"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3814"
          }
        ],
        "version-history": [
          {
            "count": 2,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3814/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3858,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3814/revisions/3858"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3815"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3814"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3814"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3814"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 3810,
      "date": "2023-01-26T14:51:02",
      "date_gmt": "2023-01-26T14:51:02",
      "guid": {
        "rendered": "https://alexmuiruri.com/?p=3810"
      },
      "modified": "2023-01-26T14:53:36",
      "modified_gmt": "2023-01-26T14:53:36",
      "slug": "what-credit-score-is-needed-to-buy-a-home",
      "status": "publish",
      "type": "post",
      "link": "https://alexmuiruri.com/uncategorized/alex-muiruri/what-credit-score-is-needed-to-buy-a-home/",
      "title": {
        "rendered": "What Credit Score is Needed to Buy a Home"
      },
      "content": {
        "rendered": "\n\u003Cp\u003EYou need a \u003Cstrong\u003Eminimum credit score of 500 to 700\u003C/strong\u003E to buy a home in 2023. Lenders favour applicants with higher credit scores, but getting a mortgage with a lower credit score is possible. \u003C/p\u003E\n\n\n\n\u003Cp\u003EThe best manoeuvre is avoiding conventional loans, which require a minimum credit score of 620. Other loan types allow for lower credit scores; some do not have these requirements. \u003C/p\u003E\n\n\n\n\u003Ch2 class=\"wp-block-heading\"\u003EMinimum Credit Score Requirements By Loan Type \u003C/h2\u003E\n\n\n\n\u003Cfigure class=\"wp-block-image size-large\"\u003E\u003Cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"686\" src=\"https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617-1024x686.jpg\" alt=\"\" class=\"wp-image-3811\" srcset=\"https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617-1024x686.jpg 1024w, https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617-300x201.jpg 300w, https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617-768x514.jpg 768w, https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /\u003E\u003C/figure\u003E\n\n\n\n\u003Cp\u003EThere are five mortgage loans you might request: conventional, Federal Housing Administration (FHA), Veterans Affairs (VA), Jumbo, and United States Department of Agriculture (USDA) loans.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EConventional Loans\u003C/h3\u003E\n\n\n\n\u003Cp\u003EConventional loans require a 620 credit score. The government does guarantee home buyers who apply for this loan type. It&#8217;s recommended for people with higher credit scores and enough money for a down payment.  \u003C/p\u003E\n\n\n\n\u003Cp\u003EYou may need to pay a minimum deposit of 5%. However, lenders and banks can sometimes increase your deposit limit based on your credit score.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EFHA Loans\u003C/h3\u003E\n\n\n\n\u003Cp\u003EFHA loans require a minimum credit score of 580. The Federal Housing Administration backs the mortgage, and lenders only require a 3.5% down payment.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can also qualify for the loan type with a 500 credit score if you make a 10% down payment. On the plus side, FHA doesn&#8217;t charge interest according to your credit score, and loans take 15 years or longer.&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EVA Loans\u003C/h3\u003E\n\n\n\n\u003Cp\u003EThere is no minimum credit score requirement for qualified service members and veterans requesting VA loans. Some lenders will request a 580 credit score.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003EVA loans have low-interest rates and don&#8217;t often require a down payment. However, you must have a \u003Ca href=\"va.gov/housing-assistance/home-loans/how-to-request-coe/\"\u003ECertificate of Eligibility\u003C/a\u003E issued by the US Department of Veteran Affairs.&nbsp;&nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EUSDA Loans\u003C/h3\u003E\n\n\n\n\u003Cp\u003EUSDA loans require a minimum credit score of 580. You don&#8217;t need to make a down payment, and the interest rates are often pretty low.\u003C/p\u003E\n\n\n\n\u003Cp\u003EYou can qualify for this loan type if you plan to live in a qualified rural or suburban area and have an income lower than 115% of the area&#8217;s median income. &nbsp;\u003C/p\u003E\n\n\n\n\u003Ch3 class=\"wp-block-heading\"\u003EJumbo Loans\u003C/h3\u003E\n\n\n\n\u003Cp\u003EThere&#8217;s no specified minimum credit score for this mortgage type. It often applies to home buyers requiring higher mortgage loans than given conventional mortgage loans.&nbsp;\u003C/p\u003E\n\n\n\n\u003Cp\u003ESo, the higher your credit score, the more chances you have of getting a loan. Depending on your credit score and income, you might qualify for lower interest rates but require a 5% to 25% down payment. \u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EYou need a minimum credit score of 500 to 700 to buy a home in 2023. Lenders favour applicants with higher credit scores, but getting a mortgage with a lower credit score is possible.  The best manoeuvre is avoiding conventional loans, which require a minimum credit score of 620. Other loan types allow for lower [&hellip;]\u003C/p\u003E\n",
        "protected": false
      },
      "author": 1,
      "featured_media": "https://alexmuiruri.com/wp-content/uploads/2023/01/pexels-pixabay-210617.jpg",
      "comment_status": "closed",
      "ping_status": "closed",
      "sticky": false,
      "template": "",
      "format": "standard",
      "meta": {
        "footnotes": ""
      },
      "categories": [1],
      "tags": [23],
      "acf": [],
      "_links": {
        "self": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3810"
          }
        ],
        "collection": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/users/1"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/comments?post=3810"
          }
        ],
        "version-history": [
          {
            "count": 2,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3810/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 3813,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/posts/3810/revisions/3813"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media/3811"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://alexmuiruri.com/wp-json/wp/v2/media?parent=3810"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/categories?post=3810"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://alexmuiruri.com/wp-json/wp/v2/tags?post=3810"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    }
  ]